title: 'Raw Disk Read Access from Powershell or CMD - T1006'
id: f287ba91-77b6-4479-b542-ef8d24ed64a1
status: 'experimental'
description: |
    This rule detects when powershell or cmd are used to read raw disk data. This can be used by attackers to bypass file access controls and read files directly from the drive.
references:
  - 'https://attack.mitre.org/techniques/T1006/'
  - 'https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventid=90009'
author: '@bleakbit'
date: '2026/04/02'
tags:
  - detection.threat_hunting
  - t1006.001
logsource:
  category: process
  product: windows
detection:
    selection_type:
        event.type: 'access'
    selection_file:
        file.directory:contains: '\Device'
    selection_executable:
        process.executable|endswith:
          - '\powershell.exe'
          - '\cmd.exe'
    condition: all of selection_*
level: 'high'  # info | low | medium | high | critical